===
Single inline comment
===

$x = 3

# This is a comment

Get-ChildItem .

---

(program
  (statement_list
    (pipeline
      (assignment_expression
        (left_assignment_expression
          (variable))
        (assignement_operator)
        (pipeline
          (integer_literal
            (decimal_integer_literal)))))
    (comment)
    (pipeline
      (command
        (command_name)
        (command_elements
          (command_argument_sep)
          (generic_token))))))

===
Single line block comment
===

$x = 3

<# Block comment #>

Get-ChildItem .

---

(program
  (statement_list
    (pipeline
      (assignment_expression
        (left_assignment_expression
          (variable))
        (assignement_operator)
        (pipeline
          (integer_literal
            (decimal_integer_literal)))))
    (comment)
    (pipeline
      (command
        (command_name)
        (command_elements
          (command_argument_sep)
          (generic_token))))))

===
Multi-line block comment
===

$x = 3

<#

Here

is a 

longer

comment           #>

Get-ChildItem .

---

(program
  (statement_list
    (pipeline
      (assignment_expression
        (left_assignment_expression
          (variable))
        (assignement_operator)
        (pipeline
          (integer_literal
            (decimal_integer_literal)))))
    (comment)
    (pipeline
      (command
        (command_name)
        (command_elements
          (command_argument_sep)
          (generic_token))))))

===
Pathological block comment #1
===

<##>
$a

---

(program
  (comment)
  (statement_list
    (pipeline
      (variable))))

===
Pathological block comment #2
===

<###>
$a


---

(program
  (comment)
  (statement_list
    (pipeline
      (variable))))
