===
Simple binary operator 1
===

$a -eq $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 2
===

$a -ne $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 3
===

$a -ge $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 4
===

$a -gt $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 5
===

$a -lt $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 6
===

$a -le $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 7
===

$a -like $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 8
===

$a -notlike $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 9
===

$a -match $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 10
===

$a -notmatch $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 11
===

$a -replace $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 12
===

$a -contains $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 13
===

$a -notcontains $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 14
===

$a -in $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 15
===

$a -notin $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 16
===

$a -split $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 17
===

$a -join $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 18
===

$a -is $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 19
===

$a -isnot $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))

===
Simple binary operator 20
===

$a -as $a

---

(program
  (statement_list
    (pipeline
      (comparison_expression
        (variable)
        (comparison_operator)
        (variable)))))
